Repository: AgenticDesktop/App
Catalog: Agentic.Desktop/Strings/*/Resources.resw
Source language: en
Languages: ja, zh_tw

# NavChat.Content
source: Chat
ja: チャット
zh_tw: 聊天

# NavSettings.Content
source: Settings
ja: 設定
zh_tw: 設定

# StatusText.Text
source: Disconnected
ja: 切断済み
zh_tw: 已斷線

# StatusDisconnected
source: Disconnected
ja: 切断済み
zh_tw: 已斷線

# StatusConnecting
source: Connecting...
ja: 接続中...
zh_tw: 連線中...

# StatusConnected
source: Connected
ja: 接続済み
zh_tw: 已連線

# TypingIndicator.Text
source: typing...
ja: 入力中...
zh_tw: 正在輸入...

# ToggleSidebarButton.ToolTipService.ToolTip
source: Toggle chats list
ja: チャット一覧を切り替え
zh_tw: 切換聊天清單

# ConnectHint.Text
source: Please connect an Agent in Settings first
ja: 先に設定で Agent を接続してください
zh_tw: 請先在設定中連線 Agent

# OpenSettingsButton.Content
source: Open Settings
ja: 設定を開く
zh_tw: 開啟設定

# InputTextBox.PlaceholderText
source: Type a message...
ja: メッセージを入力...
zh_tw: 輸入訊息...

# SendButton.ToolTipService.ToolTip
source: Send message
ja: メッセージを送信
zh_tw: 傳送訊息

# CancelButton.ToolTipService.ToolTip
source: Cancel generation
ja: 生成をキャンセル
zh_tw: 取消產生

# InputHint.Text
source: Enter to send, Shift + Enter for a new line
ja: Enter で送信、Shift + Enter で改行
zh_tw: Enter 傳送，Shift + Enter 換行

# SettingsAgentConfig.Text
source: Agent Configuration
ja: Agent 構成
zh_tw: Agent 設定

# SettingsAgentPathLabel.Text
source: Agent Path
ja: Agent パス
zh_tw: Agent 路徑

# SettingsAgentPathTextBox.PlaceholderText
source: Leave empty for Mock Agent, or enter agent executable path
ja: 空欄で Mock Agent を使用、または Agent 実行ファイルのパスを入力
zh_tw: 留空使用 Mock Agent，或輸入 Agent 執行檔路徑

# SettingsAgentPathHint.Text
source: Leave empty to use built-in Mock Agent for demo
ja: 空欄にすると組み込みの Mock Agent を使用してデモできます
zh_tw: 留空以使用內建 Mock Agent 進行展示

# SettingsAgentArgsLabel.Text
source: Agent Arguments
ja: Agent 引数
zh_tw: Agent 參數

# SettingsAgentArgsTextBox.PlaceholderText
source: Optional, e.g.: run --project path/to/project
ja: 省略可、例: run --project path/to/project
zh_tw: 選填，例如：run --project path/to/project

# SettingsAgentArgsHint.Text
source: Arguments passed to the command when starting the Agent
ja: Agent 起動時にコマンドへ渡す引数
zh_tw: 啟動 Agent 時傳遞給命令的參數

# SettingsWorkDirLabel.Text
source: Working Directory
ja: 作業ディレクトリ
zh_tw: 工作目錄

# SettingsWorkDirTextBox.PlaceholderText
source: Agent's working directory
ja: Agent の作業ディレクトリ
zh_tw: Agent 的工作目錄

# SettingsBrowseButton.Content
source: Browse...
ja: 参照...
zh_tw: 瀏覽...

# SettingsConnectButton.Content
source: Connect
ja: 接続
zh_tw: 連線

# SettingsDisconnectButton.Content
source: Disconnect
ja: 切断
zh_tw: 中斷連線

# SettingsConnectionStatus.Text
source: Connection Status
ja: 接続状態
zh_tw: 連線狀態

# ChatListTitle.Text
source: Chats
ja: チャット
zh_tw: 聊天

# NewChatButton.ToolTipService.ToolTip
source: New chat
ja: 新しいチャット
zh_tw: 新聊天

# DeleteChatButton.ToolTipService.ToolTip
source: Delete chat
ja: チャットを削除
zh_tw: 刪除聊天

# PermissionDialog.Title
source: Permission Request
ja: 権限要求
zh_tw: 權限請求

# PermissionDialog.PrimaryButtonText
source: Allow
ja: 許可
zh_tw: 允許

# PermissionDialog.CloseButtonText
source: Reject
ja: 拒否
zh_tw: 拒絕

# PermissionDescription.Text
source: The agent wants to perform the following action:
ja: Agent が次の操作を実行しようとしています：
zh_tw: Agent 希望執行以下操作：

source: Unknown action
ja: 不明な操作
zh_tw: 未知操作

# StatusNotConnected
source: Not connected
ja: 未接続
zh_tw: 未連線

# StatusConnectingProgress
source: Connecting...
ja: 接続中...
zh_tw: 連線中...

# StatusConnectedConfirm
source: Connected
ja: 接続済み
zh_tw: 已連線

# StatusAgentDisconnected
source: Agent disconnected (exit code: {0})
ja: Agent が切断されました (exit code: {0})
zh_tw: Agent 已斷線 (exit code: {0})

# StatusConnectionFailed
source: Connection failed: {0}
ja: 接続に失敗しました: {0}
zh_tw: 連線失敗: {0}

# NewChatTitle
source: New Chat
ja: 新しいチャット
zh_tw: 新聊天

# ErrorPrefix
source: [Error: {0}]
ja: [エラー: {0}]
zh_tw: [錯誤: {0}]

# ToolCallPrefix
source: [Tool: {0}]
ja: [ツール: {0}]
zh_tw: [工具: {0}]

# MockResponse1
source: I received your message:
ja: メッセージを受け取りました:
zh_tw: 我已收到你的訊息：

# MockResponse2
source: I'm a mock agent running in the UI.
ja: UI で動作しているモック Agent です。
zh_tw: 我是運行在 UI 中的 Mock Agent。

# MockResponse3
source: Connect a real ACP agent in Settings to get actual responses.
ja: 設定で実際の ACP Agent を接続すると、実際の応答を取得できます。
zh_tw: 請在設定中連線真正的 ACP Agent 以取得實際回應。

# AccessDeniedMessage
source: Access denied: {0}
ja: アクセスが拒否されました: {0}
zh_tw: 存取被拒: {0}

# StderrPrefix
source: [stderr]
ja: [標準エラー]
zh_tw: [標準錯誤]
